[
  {
    "id": 1,
    "title": "rePay - Payment App",
    "image": "assets/rePay.png",
    "description": "<p><strong>rePAY</strong> is a modern payment app clone with a seamless user experience and powerful features:<br/></p><ul><li><strong>Authentication</strong>: Users can easily sign up and sign in with <strong>secure authorization</strong> using <strong>Zod</strong> and <strong>JWT</strong>.</li><li><strong>Backend</strong>: Built using the high-performance framework <strong>Hono</strong> for fast and scalable backend operations.</li><li><strong>Frontend</strong>: Developed with <strong>React</strong>, offering a smooth and responsive user interface.</li><li><strong>Deployment</strong>: Fully deployed on <strong>Cloudflare Workers</strong>, ensuring reliable and fast access globally.</li><li><strong>Styling</strong>: Utilizes <strong>Tailwind CSS</strong> for easy and efficient styling, and <strong>Framer Motion</strong> for stunning animations and transitions.</li><li><strong>Money Transfer</strong>: Users can effortlessly send money to each other, making it a practical and functional payment solution.</li><li><strong>UI Features</strong>: The app boasts <strong>great UI animations</strong>, <strong>responsive design</strong>, and a dynamic <strong>theme toggling</strong> feature.</li></ul><p>This app combines functionality and user experience, creating a highly interactive and visually appealing payment platform.</p>",
    "isCompleted": true,
    "stackUsed": ["react", "hono", "tailwind", "postgres/prisma", "cloudflare"],
    "githubRepo": "https://github.com/hanuchaudhary/paytm-react",
    "deployedLink": "https://repay-three.vercel.app/"
  },
  {
    "id": 2,
    "title": "Medium - Blog App",
    "image": "assets/medium.png",
    "description": "<p>The <strong>Medium - Blog App</strong> is a blogging platform where users can write, edit, and share blogs seamlessly:</p><br/><ul><li><strong>Authentication</strong>: Integrated secure user authentication using <strong>JWT</strong> and <strong>Zod</strong>.</li><li><strong>Backend</strong>: Built using <strong>Hono</strong> to ensure fast and efficient handling of blog posts.</li><li><strong>Frontend</strong>: Crafted with <strong>React</strong>, providing a responsive and interactive blogging interface.</li><li><strong>Deployment</strong>: Deployed on <strong>Cloudflare Workers</strong> for scalability and reliability.</li><li><strong>Styling</strong>: Styled using <strong>Tailwind CSS</strong> to ensure a clean and modern look across devices.</li><li><strong>Content Creation</strong>: Features a rich text editor for blog writing with formatting options.</li></ul><p>This app offers a simple, elegant, and intuitive blogging experience.</p>",
    "isCompleted": true,
    "stackUsed": ["react", "hono", "tailwind", "postgres/prisma", "cloudflare"],
    "githubRepo": "https://github.com/hanuchaudhary/medium-blog",
    "deployedLink": "https://repay-three.vercel.app/"
  }
]
